Company/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'ADMIN'
OR `email` = 'ADMIN'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('username');
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $userModel->where('username', $username)->orWhere('email', $email)->first();